In [1]:
import numpy as np

import pandas as pd

import os

train=pd.read_csv('train.csv')

print('train shape',train.shape)

train shape (891, 11)

In [2]:
print(train.head())

   survived  pclass                                               name  \
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

      sex   age  sibsp  parch            ticket     fare cabin embarked
0    male  22.0      1      0         A/5 21171   7.2500   NaN        S
1  female  38.0      1      0          PC 17599  71.2833   C85        C
2  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3  female  35.0      1      0            113803  53.1000  C123        S
4    male  35.0      0      0            373450   8.0500   NaN        S

In [3]:
import torch 
import torch.nn as nn
from torch.utils.data import Dataset,DataLoader

import torch.nn.functional as F

from sklearn.preprocessing import LabelEncoder

In [4]:
test=pd.read_csv('test.csv')

In [5]:
test.head(8)

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S

In [6]:
(train.shape,test.shape)

((891, 11), (418, 10))

In [8]:
all_df=pd.concat([train,test])

In [9]:
all_df.head()

,age,cabin,embarked,fare,name,parch,pclass,sex,sibsp,survived,ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0.0,373450

In [10]:
all_df.shape

(1309, 11)

In [17]:
def preprocess(df,cat_cols):
    df=df.drop(['name','ticket','cabin'],axis=1)
    
    for cat_col in cat_cols:
        if cat_col in ['embarked']:
            df[cat_col]=LabelEncoder().fit_transform(df[cat_col].astype(str))
            
        else:
            
            df[cat_col] = LabelEncoder().fit_transform(df[cat_col])
            
    df = df.fillna(df.mean())
    return df

In [18]:
cat_cols=['pclass','sex','sibsp','parch','embarked']

all_df=preprocess(all_df,cat_cols)

all_df.head()

    age  embarked     fare  parch  pclass  sex  sibsp  survived
0  22.0         2   7.2500      0       2    1      1       0.0
1  38.0         0  71.2833      0       0    0      1       1.0
2  26.0         2   7.9250      0       2    0      0       1.0
3  35.0         2  53.1000      0       0    0      1       1.0
4  35.0         2   8.0500      0       2    1      0       0.0

In [19]:
train.shape[0]

891

In [20]:
train_df=all_df.head(train.shape[0])

In [21]:
train_df.shape[0]

891

In [ ]:
class TabularDataset(Dataset):
    def __init__(self,df,categorical_columns,output_column=None):
        super().__init__()
        self.len=df.shape[0]
        
        
        self.categorical_columns=categorical_columns
        self.continous_columns=[col for col in df.columns if col not in self.categorical_columns+[output_columns]]
        
        if self.continous